# Pandas: transformações e manipulação de dados

## Aula 1 - Entendendo o problema

1. desafio do projeto 1: vendas online será abrir a base de dados com Pandas e aplicar o json_normalize.

In [1]:
import pandas as pd

# Read the file
dados_vendas_clientes = pd.read_json("dados_vendas_clientes.json")

# See the file
dados_vendas_clientes

                                        dados_vendas
0  {'Data de venda': '06/06/2022', 'Cliente': ['@...
1  {'Data de venda': '07/06/2022', 'Cliente': ['I...
2  {'Data de venda': '08/06/2022', 'Cliente': ['I...
3  {'Data de venda': '09/06/2022', 'Cliente': ['J...
4  {'Data de venda': '10/06/2022', 'Cliente': ['M...

In [2]:
# Normalize the data
df_vendas_online = pd.json_normalize(dados_vendas_clientes["dados_vendas"])

# Vizualise
df_vendas_online.head()

  Data de venda  ...                               Valor da compra
0    06/06/2022  ...    [R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]
1    07/06/2022  ...  [R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]
2    08/06/2022  ...  [R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]
3    09/06/2022  ...   [R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]
4    10/06/2022  ...  [R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]

[5 rows x 3 columns]

2. desafio do projeto 2: administração de condomínios será similar ao desafio do projeto 1, abrir a base de dados com Pandas e aplicar o json_normalize no DataFrame.

In [3]:
# Read the file
dados_locacao_imoveis = pd.read_json("dados_locacao_imoveis.json")

# See the file
dados_locacao_imoveis

                                        dados_locacao
0   {'apartamento': 'A101 (blocoAP)', 'datas_combi...
1   {'apartamento': 'A102 (blocoAP)', 'datas_combi...
2   {'apartamento': 'B201 (blocoAP)', 'datas_combi...
3   {'apartamento': 'B202 (blocoAP)', 'datas_combi...
4   {'apartamento': 'C301 (blocoAP)', 'datas_combi...
5   {'apartamento': 'C302 (blocoAP)', 'datas_combi...
6   {'apartamento': 'D401 (blocoAP)', 'datas_combi...
7   {'apartamento': 'D402 (blocoAP)', 'datas_combi...
8   {'apartamento': 'E501 (blocoAP)', 'datas_combi...
9   {'apartamento': 'E502 (blocoAP)', 'datas_combi...
10  {'apartamento': 'F601 (blocoAP)', 'datas_combi...
11  {'apartamento': 'F602 (blocoAP)', 'datas_combi...
12  {'apartamento': 'G701 (blocoAP)', 'datas_combi...
13  {'apartamento': 'G702 (blocoAP)', 'datas_combi...
14  {'apartamento': 'H801 (blocoAP)', 'datas_combi...

In [4]:
# Normalize the data
df_locacao_imoveis= pd.json_normalize(dados_locacao_imoveis["dados_locacao"])

# Vizualise
df_locacao_imoveis.head()

      apartamento  ...                     valor_aluguel
0  A101 (blocoAP)  ...  [$ 1000,0 reais, $ 2500,0 reais]
1  A102 (blocoAP)  ...  [$ 1100,0 reais, $ 2600,0 reais]
2  B201 (blocoAP)  ...  [$ 1200,0 reais, $ 2700,0 reais]
3  B202 (blocoAP)  ...  [$ 1300,0 reais, $ 2800,0 reais]
4  C301 (blocoAP)  ...  [$ 1400,0 reais, $ 2900,0 reais]

[5 rows x 4 columns]

## Aula 2 - Dados numéricos

### Projeto desafio 1: vendas online
Lemos a base de dados no desafio anterior, agora podemos avançar nas transformações desses dados. Então, o novo desafio do projeto 1 será dividido em algumas metas:

Remover os dados em listas dentro do DataFrame;\
Verificar os tipos de dados;\
Identificar colunas numéricas;\
Transformar a coluna numérica para o tipo numérico.

In [5]:
# Columns
columns_vendas_online = list(df_vendas_online.columns)
columns_vendas_online

['Data de venda', 'Cliente', 'Valor da compra']

In [6]:
# Expanding the columns
df_vendas_online = df_vendas_online.explode(columns_vendas_online[1:])

df_vendas_online.head()

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
0    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
0    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
0    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
1    07/06/2022  Isabely JOanes 738       R$ 825,31

In [7]:
# Reset index
df_vendas_online.reset_index(drop=True,inplace=True)

df_vendas_online.head()

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
1    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
2    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
3    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
4    07/06/2022  Isabely JOanes 738       R$ 825,31

In [8]:
# Dataframe types
df_vendas_online.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     object
dtypes: object(3)
memory usage: 612.0+ bytes

In [9]:
import numpy as np

# Edit to decimal
df_vendas_online['Valor da compra'] = df_vendas_online['Valor da compra'].apply(lambda x: x.replace('R$ ', '').replace(',','.').strip())

In [10]:
# Change data type
df_vendas_online['Valor da compra'] = df_vendas_online['Valor da compra'].astype(np.float64)

In [11]:
df_vendas_online.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

### Projeto desafio 2: administração de condomínios
Lemos a base de dados no desafio anterior, agora podemos avançar nas transformações desses dados. Então, da mesma forma que o projeto 1, o desafio do projeto 2 está listado em algumas metas:

Remover os dados em listas dentro do DataFrame;\
Verificar os tipos de dados;\
Identificar colunas numéricas;\
Transformar a coluna numérica para o tipo numérico.

In [12]:
# Columns
columns_locacao_imoveis = list(df_locacao_imoveis.columns)
columns_locacao_imoveis

['apartamento',
 'datas_combinadas_pagamento',
 'datas_de_pagamento',
 'valor_aluguel']

In [13]:
# Expanding the columns
df_locacao_imoveis = df_locacao_imoveis.explode(columns_locacao_imoveis[1:])

df_locacao_imoveis.head()

      apartamento datas_combinadas_pagamento datas_de_pagamento   valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022  $ 1000,0 reais
0  A101 (blocoAP)                 01/07/2022         03/07/2022  $ 2500,0 reais
1  A102 (blocoAP)                 02/06/2022         02/06/2022  $ 1100,0 reais
1  A102 (blocoAP)                 02/07/2022         06/07/2022  $ 2600,0 reais
2  B201 (blocoAP)                 03/06/2022         07/06/2022  $ 1200,0 reais

In [14]:
# Dataframe types
df_locacao_imoveis.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 0 to 14
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     object
dtypes: object(4)
memory usage: 1.2+ KB

In [15]:
# Edit to decimal
df_locacao_imoveis['valor_aluguel'] = df_locacao_imoveis['valor_aluguel'].apply(lambda x: x.replace('$ ', '').replace(',','.').replace("reais", '').strip())

df_locacao_imoveis.head()

      apartamento datas_combinadas_pagamento datas_de_pagamento valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022        1000.0
0  A101 (blocoAP)                 01/07/2022         03/07/2022        2500.0
1  A102 (blocoAP)                 02/06/2022         02/06/2022        1100.0
1  A102 (blocoAP)                 02/07/2022         06/07/2022        2600.0
2  B201 (blocoAP)                 03/06/2022         07/06/2022        1200.0

In [16]:
# Change data type
df_locacao_imoveis['valor_aluguel'] = df_locacao_imoveis['valor_aluguel'].astype(np.float64)

In [17]:
df_locacao_imoveis.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 0 to 14
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     float64
dtypes: float64(1), object(3)
memory usage: 1.2+ KB

## Aula 3 - Dados Textuais

### Projeto desafio 1: vendas online
Na etapa 2, trabalhamos na transformação dos dados numéricos. Agora, podemos trabalhar com valores textuais.

Devido a uma instabilidade no site da empresa, tivemos problemas com os nomes dos clientes durante o salvamento. Isso resultou em uma coluna de nomes de clientes com uma mistura de letras, maiúsculas e minúsculas, números e outros caracteres.

Sabendo disso, manipule os textos presentes na coluna Cliente para que seja obtido como resultado os nomes dos clientes em letras minúsculas, com a ausência de caracteres especiais ou números.

In [18]:
# Lowering the words
df_vendas_online["Cliente"] = df_vendas_online["Cliente"].str.lower()

df_vendas_online.head()

  Data de venda             Cliente  Valor da compra
0    06/06/2022     @ana _lucia 321           836.50
1    06/06/2022  diego armandiu 210           573.33
2    06/06/2022  diego armandiu 210           392.80
3    06/06/2022  diego armandiu 210           512.34
4    07/06/2022  isabely joanes 738           825.31

In [19]:
# Replacing
df_vendas_online["Cliente"] = df_vendas_online["Cliente"].str.replace("[^a-z ]", '', regex=True).str.strip()

df_vendas_online.head()

  Data de venda         Cliente  Valor da compra
0    06/06/2022       ana lucia           836.50
1    06/06/2022  diego armandiu           573.33
2    06/06/2022  diego armandiu           392.80
3    06/06/2022  diego armandiu           512.34
4    07/06/2022  isabely joanes           825.31

### Projeto desafio 2: administração de condomínios
Na etapa 2, trabalhamos na transformação dos dados numéricos. Agora, podemos trabalhar com valores textuais.

Buscando explicar a organização da identificação dos apartamentos, durante a criação do conjunto de dados, foi adicionado o texto (blocoAP). Esse texto informa que os nomes dos apartamentos estão organizados com a letra do bloco seguida do número do apartamento. No entanto, isso não traz nenhuma informação para nossos dados, sendo interessante realizar a remoção desse texto no conjunto de dados.

Com isso, manipule os textos na coluna apartamento para remover o texto (blocoAP) do DataFrame.

In [20]:
# Removing BlocoAP
df_locacao_imoveis['apartamento'] = df_locacao_imoveis['apartamento'].str.replace(' \(blocoAP\)', '', regex=True)

df_locacao_imoveis.head()

  apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0        A101                 01/06/2022         05/06/2022         1000.0
0        A101                 01/07/2022         03/07/2022         2500.0
1        A102                 02/06/2022         02/06/2022         1100.0
1        A102                 02/07/2022         06/07/2022         2600.0
2        B201                 03/06/2022         07/06/2022         1200.0

## Aula 4 - Dados de tempo

### Projeto desafio 1: vendas online
Nas etapas anteriores, já trabalhamos com vários tipos de dados, agora podemos trabalhar com os dados de tempo.

Na coluna Data de venda, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

Se você não lembra o problema do projeto desafio 1, vou deixar abaixo o texto da situação para facilitar o encontro da informação:

O objetivo desse projeto é realizar uma análise dos resultados de um evento com os clientes de uma empresa de vendas online. Foi coletado um conjunto de dados que contém os clientes que mais gastaram com produtos dentro de 5 dias de vendas, que é o período de duração do evento. Essa análise vai identificar o cliente com a maior compra na semana, que irá receber um prêmio da loja, e posteriormente, ela pode ajudar a empresa a criar novas estratégias para atrair mais clientes.

In [21]:
# Transform into date
df_vendas_online["Data de venda"] = pd.to_datetime(df_vendas_online["Data de venda"])
# Adjust the format
df_vendas_online["Data de venda"].dt.strftime("d%m%Y")
# Check if it worked
df_vendas_online.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 612.0+ bytes

In [34]:
# Finding the client that bought more items
total_compras = df_vendas_online.groupby(['Cliente'])['Valor da compra'].sum()

total_compras.sort_values(ascending=False)

print(total_compras.idxmax(), total_compras.max())

isabely joanes 2329.3

### Projeto desafio 2: administração de condomínios
Assim como no projeto desafio 1, trabalhamos com todas as colunas exceto as que envolvem datas.

Nas colunas datas_de_pagamento e datas_combinadas_pagamento, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

Se você não lembra o problema do projeto desafio 2, vou deixar abaixo o texto da situação para facilitar o encontro da informação:

A administração de condomínios é uma tarefa que requer muita atenção e organização. Entre as diversas responsabilidades da gestão está o recebimento dos aluguéis dos locatários. Para garantir uma boa saúde financeira do empreendimento, é fundamental que esses pagamentos sejam feitos de forma regular e pontual. No entanto, sabemos que nem sempre isso acontece. Pensando nisso, proponho um desafio de tratamento de dados com o objetivo de analisar o atraso no pagamento de aluguéis no condomínio fictício de alguns moradores.

In [39]:
# Transform into date
df_locacao_imoveis['datas_combinadas_pagamento'] = pd.to_datetime(df_locacao_imoveis['datas_combinadas_pagamento'], format='%d/%m/%Y')
df_locacao_imoveis['datas_de_pagamento'] = pd.to_datetime(df_locacao_imoveis['datas_de_pagamento'], format='%d/%m/%Y')

In [41]:
# Calculate the delay in the payment
df_locacao_imoveis['Atraso'] = (df_locacao_imoveis['datas_de_pagamento'] - df_locacao_imoveis['datas_combinadas_pagamento']).dt.days

In [42]:
# Calculate the mean of the delay in the payment
media_atraso = df_locacao_imoveis.groupby(['apartamento'])['Atraso'].mean()

media_atraso

apartamento
A101    3.0
A102    2.0
B201    2.0
B202    2.0
C301    4.5
C302    4.0
D401    1.0
D402    4.0
E501    0.5
E502    4.0
F601    4.0
F602    1.5
G701    6.5
G702    2.0
H801    2.0
Name: Atraso, dtype: float64